rails-application/app/controllers/activities_controller.rb

INSERT INTO "activities" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Learn"], ["created_at", "2022-10-10 13:29:13.770629"], ["updated_at", "2022-10-10 13:29:13.770629"]]
---
  def create
    @activity = Activity.new(activity_params)

    respond_to do |format|
      if @activity.save