rails-application/app/controllers/merits_controller.rb

	def balances
		@user = User.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]