rails-application/app/read-models/time_harvest/report.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
      def time_consumed(event)
        account_id = event.data.fetch(:account_id)
        report = Report.find_by(account_id: account_id)
        unless report.present?
          # TODO make a 1-to n for user->accounts
          user = User.first